<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <title>JWChat - Помощь</title>
    <meta http-equiv="content-type" content="text/html; charset=utf-8">
    <script src="switchStyle.js" language="JavaScript1.2"></script>
    <style type="text/css">
      body { margin: 8px; background-color: white; }
      ul,li { margin-left: 14px; padding-left: 0px; }
    </style>
  </head>

  <body>
    <h1>JWChat - Помощь</h1>

    <h2><a name="toc">Содержание</a></h2>

    <ol>
      <li><a href="#intro">Введение</a>
      <li><a href="#supported">Поддерживаемые браузеры</a>
      <li><a href="#contact_list">Ваш список контактов</a>
        <ol>
          <li><a href="#status">Индикатор статуса присутствия</a>
          <li><a href="#useradd">Добавление пользователя в список контактов</a>
        </ol>
      <li><a href="#prefs">Настройка (Ваши установки)</a>
    </ol>

    <h2><a name="intro">Введение</h2></a>
    
    <img src="images/screenshots/jwchat.gif" width="168" height="344" alt="jwc screenshot" align="left" style="padding-right:4px;"> 
    
    JWChat &mdash; система мгновенного обмена сообщениями (IM) для веб, такая же как AIM, MSN Messenger, Yahoo! Messenger или ICQ: вы сможете составить список контактов и непосредственно общаться с другими пользователями. В отличие от других систем, для использования JWChat достаточно браузера, установка другого программного обеспечения не требуется. Ниже находится список <a href="#supported">поддерживаемых браузеров</a>. Ваш список контактов хранится на сервере, поэтому у вас будет доступ к нему практически с любого компьютера, подключенного к интернету.

    <br clear="all">

    <h2><a name="supported">Поддерживаемые браузеры</a></h2>
    
    Поддерживаемые браузеры и платформы:
    <p>
      <b>Windows XP/2000/ME/98/95:</b>
  <ul>
    <li>MS Internet Explorer с версии 5.0</li>
    <li>Netscape версия 6 & 7</li>
    <li>Mozilla (stable) с версии 1.0.2</li>
  </ul>
  
  
    <p>
    <b>Mac OS X:</b>
    <ul>
      <li>Mozilla (stable) с версии 1.0.2</li>
      <li>Camino 0.7</li>
      <li>Safari начиная с версии 3</li>
    </ul>
  
    <p>
      <b>Linux:</b>
      <ul>
        <li>Mozilla начиная с версии 1.0.2</li>
      </ul>
    </p>
    
    <h2><a name="contact_list">Ваш список контактов</a></h2>

    <img src="images/screenshots/jwchat-contextmenu.gif" width="168" height="344" alt="the context menu" align="left">
    Список контактов содержит записи для каждого добавленного Вами пользователя. При щелчке правой кнопкой на элемент списка выводится контекстное меню, показанное на снимке слева:

    <ul>
      <li>Отправить сообщение: открывает окно сообщений для данного пользователя
      <li>Начать чат: Открывает окно чата для данного пользователя
      <li>Редактировать пользователя: Открывает диалоговое окно редактирования для данного пользователя, где Вы можете установить его ник и изменить группы, к которым он/она принадлежит
      <li>Показать информацию: Показывает анкету пользователя
      <li>История: открывает историю сообщений для данного пользователя.
      <li>Переавторизация: Открывает запрос на авторизацию для данного пользователя
      <li>Удалить: Удаляет данного пользователя из Вашего списка контактов (полностью) и отменяет его/ее авторизацию.
    </ul>

    Нажатие левой кнопкой мыши на пользователе открывает диалоговое окно для сообщений.

    <br clear="all">
    <h3><a name="status">Индикатор статуса присутствия</a></h3>
    
    <img src="images/available.gif" align="middle"> - Пользователь online<br>
    <img src="images/chat.gif" align="middle"> - Пользователь готов чатиться<br>
    <img src="images/away.gif" align="middle"> - Пользователь отошел<br>
    <img src="images/xa.gif" align="middle"> - Пользователь не доступен<br>
    <img src="images/dnd.gif" align="middle"> - Пользователь не хочет, чтобы его беспокоили<br>
    <img src="images/unavailable.gif" align="middle"> - Пользователь отключен<br>
    <img src="images/invisible.gif" align="middle"> - Пользователь невидим<br>
    <img src="images/stalker.gif" align="middle"> - Пользователь не авторизовал Вас<br>
    
    <p>Измените свой статус присутствия путем выбора состояния из списка выбора внизу вашего списка контактов. Для некотрых состояний Вы можете установить индивидуальное сообщение, которое показывается другим пользователям. Если Вы выберете "невидимый" , то другие пользователи будут видеть Ваше состояние как "отключенный".</p>
      
    <h3><a name="useradd">Добавление пользователя в список контактов</a></h3>
          
    Для добавления пользователя нажмите <img src="images/screenshots/add-button.gif" width="24" height="22" alt="Добавить пользователя">. Введите ник пользователя в поле запроса авторизации и нажмите "Отправить". Дополнительно вы можете ввести индивидуальное сообщение ниже в текстовой области. Запрос авторизации с этим сообщением отправляется пользователю. Если он/она его принимает, с этого момента вы можете видеть его/ее <a href="#status">online статус</a>.

    <p>
      После отправки запроса на подписку пользователь добавляется в ваш список контактов и всплывает диалог редактирования пользователя, где вы можете установить индивидуальный ник для этого пользователя  и добавить его/ее в одну или более групп в своем списке контактов

    <p>
      Вы можете создать новую группу пользователей, введя название в поле "Группа" над списком "Доступных групп" и нажав после этого кнопку "&gt;". Удалите пользователя из группы нажатием на "&lt;". Группа будет удалена из вашего списка контактов, если в ней не останется пользователей.


    <h2><a name="prefs">Настройка (Ваши установки)</a></h2>

    Откройте диалог установок путем нажатия на <img src="images/screenshots/pref-button.gif" width="24" height="22" alt="Установки">. Вот краткое объяснение для каждой опции, которую Вы можете выбрать:

    <ul>
      <li>Спрятать отключенных пользователей<br>
        Скрывает пользователей, которые не подключены, в списке контактов.
      <li>Автоматически открывать сообщения и чаты<br>
        Если выбрано, то каждый раз, когда Вы получаете сообщение от другого пользователя, всплывает соответствующее диалоговое окно.
      <li>Авто-всплытие при отсутствии<br>
        Выводить ли всплывающие окна с сообщениями если ваш статус не "онлайн" или "доступен для чата"
      <li>Проигрывать звуки<br>
        Если выбрано, то для определенных действий, таких как входящие сообщения или переход пользователя из состояния 'подключен' в состояние 'отключен' , будет произведен звуковой сигнал .
      <li>Поднимать окно при получении сообщения<br>
        Окно с вашим списком контактов или обменом сообщениями будет поднято поверх всех остальных открытых окон при приходе нового сообщения
      <li>Отображать время в чатах один на один<br>
        Будет показывать время прихода сообщения справа от имени пользователя в диалоге чата
    </ul>

    <hr noshade>
    <address>&copy 2003 <a href="mailto:steve@zeank.in-berlin.de">Stefan Strigler</a></address>
<!-- Created: Thu Jun 26 19:11:34 CEST 2003 -->
<!-- hhmts start -->
Last modified: Mon Dec  5 18:46:40 CET 2005
<!-- hhmts end -->
  </body>
</html>
